Repository: ministryofjustice/money-to-prisoners-bank-admin
Catalog: mtp_bank_admin/translations/*/LC_MESSAGES/django.po
Languages: cy

source: Go to the homepage
cy: Ewch i dudalen gartref

source: Bank admin
cy: Banc gweinyddol

source: Invalid format for receipt_date
cy: Fformat annilys ar gyfer receipt_date

source: 'receipt_date' parameter required
cy: Angen paramedr ar gyfer y 'receipt_date'

source: No transactions available
cy: Dim trafodion ar gael

source: This file cannot be downloaded until the next working day
cy: Ni ellir lawrlwytho'r ffeil hon tan y diwrnod gwaith nesaf

source: There was a problem generating the file. Please try again later.
cy: Roedd yna broblem wrth gynhyrchu'r ffeil. Rhowch gynnig arall arni hwyrach ymlaen.

source: Download files
cy: Lawrlwytho ffeiliau

source: Access Pay file – refunds
cy: Ffeil Access Pay – ad-daliadau

source: Download file for %(date)s
cy: Lawrlwytho ffeil ar gyfer %(date)s

source: Previous AccessPay refund files
cy: Ffeiliau ad-dalu AccessPay blaenorol

source: Download transactions for %(date)s
cy: Lawrlwytho trafodion ar gyfer %(date)s

source: Previous ADI Journals
cy: ADI Journals blaenorol

source: Bank statement
cy: Cyfriflen banc

source: Previous bank statements
cy: Cyfriflenni banc blaenorol

source: Built by
cy: Cynhyrchwyd gan

source: Ministry of Justice
cy: Y Weinyddiaeth Cyfiawnder
